In [9]:
import numpy as np
import pandas as pd
data = [['Anu', 'A', 5.4], ['Anu', 'B', 6.7], ['Anu', 'C', 10.1],['Jenny', 'A', 6.5], ['Jenny', 'B', 5.9], ['Jenny', 'C', 12.2],['Tom', 'A', 4.0], ['Tom', 'B', None], ['Tom', 'C', 9.5]]

In [10]:
print(data, end='')

[['Anu', 'A', 5.4], ['Anu', 'B', 6.7], ['Anu', 'C', 10.1], ['Jenny', 'A', 6.5], ['Jenny', 'B', 5.9], ['Jenny', 'C', 12.2], ['Tom', 'A', 4.0], ['Tom', 'B', None], ['Tom', 'C', 9.5]]

In [12]:
df = pd.DataFrame(data , columns=['Student', 'Compound', 'Yield /g'])
df

  Student Compound  Yield /g
0     Anu        A       5.4
1     Anu        B       6.7
2     Anu        C      10.1
3   Jenny        A       6.5
4   Jenny        B       5.9
5   Jenny        C      12.2
6     Tom        A       4.0
7     Tom        B       NaN
8     Tom        C       9.5

In [16]:
grouped = df.groupby('Compound')
list(grouped)

[('A',
    Student Compound  Yield /g
  0     Anu        A       5.4
  3   Jenny        A       6.5
  6     Tom        A       4.0),
 ('B',
    Student Compound  Yield /g
  1     Anu        B       6.7
  4   Jenny        B       5.9
  7     Tom        B       NaN),
 ('C',
    Student Compound  Yield /g
  2     Anu        C      10.1
  5   Jenny        C      12.2
  8     Tom        C       9.5)]

In [19]:
grouped.mean()

C:\Users\Rabo Yusuf\AppData\Local\Temp\ipykernel_5384\3907159713.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grouped.mean()

          Yield /g
Compound
A              5.3
B              6.3
C             10.6

In [20]:
grouped.max()

         Student  Yield /g
Compound
A            Tom       6.5
B            Tom       6.7
C            Tom      12.2

In [21]:
grouped.min()

         Student  Yield /g
Compound
A            Anu       4.0
B            Anu       5.9
C            Anu       9.5

### The object returned by groupby() can be iterated over:

In [22]:
for compound , group in grouped:
    print('Compound:', compound)
    print(group)

Compound: A
  Student Compound  Yield /g
0     Anu        A       5.4
3   Jenny        A       6.5
6     Tom        A       4.0
Compound: B
  Student Compound  Yield /g
1     Anu        B       6.7
4   Jenny        B       5.9
7     Tom        B       NaN
Compound: C
  Student Compound  Yield /g
2     Anu        C      10.1
5   Jenny        C      12.2
8     Tom        C       9.5

In [3]:
import pandas as pd
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'], 'data1': range(6), 'data2': rng.randint(0, 10, 6)},
columns = ['key', 'data1', 'data2'])

In [6]:
df.groupby('key').aggregate([min, np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [7]:
df.groupby('key').aggregate({'data1': min, 'data2': max})

     data1  data2
key
A        0      5
B        1      7
C        2      9

In [18]:
for (key, value) in df.groupby('key'):
    print(key, '|', value[['data1', 'data2']])

A |    data1  data2
0      0      5
3      3      3
B |    data1  data2
1      1      0
4      4      7
C |    data1  data2
2      2      3
5      5      9

In [22]:
def filter_func(x):
    return x['data2'].std() < 3
df.groupby('data2').filter(filter_func)

  key  data1  data2
2   C      2      3
3   A      3      3

In [24]:
def center(x):
    return x - x.mean()
df.groupby('key').transform(center)

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

In [29]:
def norm_by_data(x):
    x['data1'] /= x['data2'].sum()
    return x
df.groupby('key').apply(norm_by_data)

C:\Users\Rabo Yusuf\AppData\Local\Temp\ipykernel_16660\64294378.py:4: FutureWarning: Not prepending group keys to the result index of transform-like apply. In the future, the group keys will be included in the index, regardless of whether the applied function returns a like-indexed object.
To preserve the previous behavior, use

	>>> .groupby(..., group_keys=False)

To adopt the future behavior and silence this warning, use

	>>> .groupby(..., group_keys=True)
  df.groupby('key').apply(norm_by_data)

  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9